---
kind: type
id: T:Autodesk.Revit.DB.EaveCutterType
source: html/e07e48f8-2ed3-8022-9905-4c5efbf2f185.htm
---
# Autodesk.Revit.DB.EaveCutterType

An enumerated type to store type of EaveCutter.

## Syntax (C#)
```csharp
public enum EaveCutterType
```